#### RevisionNumberType Enumeration

---

|  |
| --- |
| See Also |

Determines how a particular revision will be numbered.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2015
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public enum RevisionNumberType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RevisionNumberType ``` |

| Visual C++ |
| --- |
| ``` public enum class RevisionNumberType ``` |

# Members

| Member name | Description |
| --- | --- |
| Numeric | The Revision Number will be a number. |
| None | No Revision Number will be assigned. |
| Alphanumeric | The Revision Number will be a string taken from a user-specified sequence of arbitrary strings. |

# See Also

Autodesk.Revit.DB Namespace